app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 202], ["LIMIT", 1]]
INSERT INTO "answers" ("body", "question_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "ljLASKJDLASKDJASDA'D"], ["question_id", 202], ["created_at", "2019-07-08 17:24:53.791663"], ["updated_at", "2019-07-08 17:24:53.791663"], ["user_id", 14]]
---
  def create
    @question = Question.find(params[:question_id])
    @answer = Answer.new answer_params
    @answer.question = @question
    @answer.user = current_user
    if @answer.save

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 242], ["LIMIT", 1]]
---
  def destroy
    @answer = Answer.find params[:id]