app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "body", "created_at", "updated_at", "view_count", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    # # The 'params' object available in controllers
    # # is composed of the query string, url params,
    # # and the body of a form
    # # (e.g. req.query + req.params + req.body)
    #
    # # A good trick to see if your routes are working
    # # and you're getting the data that you want, is to
    # # render the params as JSON. This is like doing
    # # res.send(req.body) in Express

    # Use 'require' on the params object to retrieve
    # the nested hash of a key usually corresponding to
    # the name-value pairs of a form

    # Then use permit to specify all input names that
    # are allowable (as symbols).
    @question = Question.new question_params
    @question.user = current_user
    if @question.save

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 ORDER BY "answers"."created_at" DESC  [["question_id", 1]]
---
  def show
    # For the 'form_with' helper
    @answer = Answer.new
    # For the list of answers
    @answers = @question.answers.order(created_at: :desc)

UPDATE "questions" SET "title" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["title", "qwewqewqwqdqwqewq"], ["updated_at", "2019-07-07 23:06:43.661297"], ["id", 1]]
---
  def update
    # attempt to edit the existing question with new values
    if @question.update question_params

DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 202]]
---
  def destroy
    flash[:notice] = "Question destoryed!"
    @question.destroy

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
---
  def find_question
    # get the current value inside of the db
    @question = Question.find params[:id]